v<template>
    <div>
        <div class="project_introduce">
            <p>
                权限管理菜单栏我只做了用户管理页面，我认为其它的界面都大同小异，所以没有再多做其它页面。用户管理界面里面的交互其实就是正常的数据的增删改查，
                以及一个菜单权限的分配。
            </p>
            <p>
                搜索功能：其实搜索的功能应该是发送请求携带搜索的关键词，然后后端返回对应的数据给前端，但是我主要是学前端的，所以我直接就自己去做了一个查找功能，
                大致就是获取到全部数据后，复制一份，然后根据最初的数据进行查找，这一个数据是不需要改变的，专门提供给查找时用来修改展示的数据，我的查找条件是同时
                满足三个搜索的关键词，如果是空的就不作为查找的条件，重置的时候就是把三个表单数据都置为空然后展示原数据。
            </p>
            <p>
                新建用户：我单独做了一个新建用户的弹窗组件，里面使用了element组件库的Form组件，以及时间选择，下拉选择框等都是element的组件，做了一些规则必填等
                条件，其实没有什么难度就是了解element组件库的使用就好，然后就是填写完数据发送请求到后端，后端做进一步的创建处理然后返回结果。不过难的还是后端的
                数据结构问题，在后续的开发过程中我数据结构弄的比较乱，导致我前后端一直改来改去，所以开发之前还是需要想好一整套的逻辑交互以及需要的数据结构等。特别是
                TS中定义类型的时候是强制的，数据不对就会报红。
            </p>
            <p>
                编辑用户：编辑用户信息弹窗我也做了一个组件，基本和新建用户的差不多，但是两个组件可以做成一个，可以不用做两个，只要在点击编辑的时候，打开的组件弹窗传入对应的
                用户数据就好，但是当时我懒得改了。
            </p>
            <p>
                删除功能：删除的后端接口我只做了一个，传递的数据是一个用户id数组，这个操作就很简单了，遍历删除对应所存在的用户数据就好。前端在点击删除的时候只要
                做一个判断，判断当前删除的数组里面是否有自己，如果需要删除的用户数据有自己就提醒，不执行删除操作。
            </p>
        </div>
        <div class="project_introduce">
            <p style="color: #ff1000;">
                此项目只是我的一个学习Vue3的练习项目，因为视频教程的接口崩溃，所以我根据页面做模板，自行从0-1开发的后台管理系统练习，并且由于时间问题没有做的很完善，肯定有
                很多需要完善的地方，但出于我练手的目的，没有再去更进一步的完善，如果有什么要补充的内容或者问题以及bug可以联系我，有时间都会补充或者解释，代码可以自行
                下载去更改或者增加内容，项目的基础结构基本结构是有的，只是可能有的地方需要完善。
            </p>

        </div>
    </div>
</template>

<script setup lang="ts">

</script>

<style scoped lang="scss">
.project_introduce {
    text-indent: 2em;
    line-height: 30px;
    font-weight: 700;
    font-size: 18px;
    margin: 20px 0;

    p {
        margin: 10px 0;
    }
}
</style>