v<template>
    <div>
        <div class="project_introduce">
            <p>
                商品管理菜单栏我只做了品牌管理页面，里面完成了品牌数据的展示，新增品牌，编辑品牌，删除品牌等操作，此页面我分成了两个组件，一个组件是新增和编辑
                按钮时的弹窗组件，一个是展示tabel主体数据的组件，table数据的展示使用了element框架的Table组件，里面的数据没有使用懒加载，所以每次点击切换下一页的
                时候会根据当前所处的第几页，当前一列展示多少条数据发送请求，从后端获取数据，当然后端的数据处理也是我自己弄的逻辑，可以放在前端做，但是一般都是前端
                发送请求去获取数据从而展示，所以这个逻辑我放到了后端。
            </p>
            <p>
                由于本人不擅长后端，所以这个当前显示的数据是自己做的处理，正常应该是通过数据库查找对应的数据，然后再传递给前端。并且由于后端技术的问题，有一个
                比较严重的问题，就是上传的图片只能当前在线能显示，因为我还没有学到把图片保存到服务器，所以我在前端把图片文件地址转成了blob形式地址路径传递到了后端，所以页面关闭或者
                刷新的时候会导致图片显示错误。（此问题已解决，如有其他bug请私信）
            </p>
        </div>
        <div class="project_introduce">
            <p style="color: #ff1000;">
                此项目只是我的一个学习Vue3的练习项目，因为视频教程的接口崩溃，所以我根据页面做模板，自行从0-1开发的后台管理系统练习，并且由于时间问题没有做的很完善，肯定有
                很多需要完善的地方，但出于我练手的目的，没有再去更进一步的完善，如果有什么要补充的内容或者问题以及bug可以联系我，有时间都会补充或者解释，代码可以自行
                下载去更改或者增加内容，项目的基础结构基本结构是有的，只是可能有的地方需要完善。
            </p>
        </div>
    </div>
</template>

<script setup lang="ts">

</script>

<style scoped lang="scss">
.project_introduce {
    text-indent: 2em;
    line-height: 30px;
    font-weight: 700;
    font-size: 18px;
    margin: 20px 0;

    p {
        margin: 10px 0;
    }
}
</style>